%% Array 矩阵
%% 一、创建martix

%1.直接赋值法
x=[];
x=[1 2;3 4]

%2.内置函数法
y=zero(3);  %3*3全零矩阵
z=ones(4);  %4*4全一矩阵
b=eye(5);   %5*5 单位举证
c=diag([3,2,1]) % 对角矩阵
d=rand(3,2,1) ;% 3*2随机矩阵

%3.  :和linspace
clear;
clc;
x=0:0.1:2*pi;  %冒号表达式不能到右边 vs python 切片法 ；range生成列表
y=linspace(0,2*pi,10)


%% 二、矩阵的运算

%矩阵整体运算 + - * /
clear;
clc;
A = [1 2;3 4];B = [2 4;3 1]
ApB = A+B;
AmB = A-B;
AcB = A\B;
AzcB = inv(A)*B;
AycB=A/B;
AyB=A*inv(B);
TA=A';
F=A^2;
%对应元素点乘点除点^ .* ；./；.^对应元素n次方
C=A.*B;
D=A./B;
E=A.^3;
%%  三、矩阵的索引
clear;
clc;
%1.下标索引法 ：只能取一个值
A=[1 2 3;3 5 5;3 4 5];
as=A(1,1);
AB=A(end-1,end-1);
%2.冒号索引法：可以取很多值
A=[1 2 3;3 5 5;3 4 5];
c1=A(:,1); %取第一列
c2=A(2,:); %取第二行
c3=A(1:2,:); %取1，2行
%3.位置索引法
clear;
clc;
B=rand(5);
B(5)=100; %仅有一个下标 默认为位置索引法：一个列向量
% B(:)=0;
%4.矩阵块索引法
B([1,3],[2,3])=0; %取第一行 第三行 ；第二列 第三列 置0
%5.布尔（矩阵）索引法
clc
C=randn(4); % 正态分布的随机数 4*4矩阵
C(C<0)=0; %小于0置0
Co=C>0;%已经刷选过的C 大于0置1

